Revit 2027 API
RenderingImageExposureSettings.Saturation Property
 The value of rendering image saturation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Saturation { get; set; }
Public Property Saturation As Double
	Get
	Set
public:
property double Saturation {
	double get ();
	void set (double value);
}
member Saturation : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The value of saturation is not valid. The valid range is 0 to 5.
Remarks
 Increase this value to get more intense colors.
See Also
Reference
RenderingImageExposureSettings Class
Autodesk.Revit.DB Namespace